app/Controllers/Admin/Dashboard.php

SELECT *
FROM `blogs`
---
    public function index()
    {
        $this->requireLogin();
        $this->checkRole('admin');

        $model = new BlogModel();
        $data['blogs'] = $model->findAll(); // all blogs