app/Controllers/Author/Dashboard.php

    public function rejectedBlogs()
{
    $this->requireLogin();
    $this->checkRole('author');

    $model = new \App\Models\BlogModel();
    $authorId = session()->get('user_id');

    $data['blogs'] = $model->where('author_id', $authorId)
                           ->where('is_approved', -1)
                           ->orderBy('created_at', 'DESC')
                           ->findAll();
---
SELECT *
FROM `blogs`
WHERE `author_id` = '2'
AND `is_approved` = -1
ORDER BY `created_at` DESC