app/Controllers/Author/Dashboard.php

    public function index()
    {
        $this->requireLogin();
        $this->checkRole('author');

        $model = new BlogModel();
        $authorId = session()->get('user_id');

        $data['blogs'] = $model->where('author_id', $authorId)
                               ->orderBy('created_at', 'DESC')
                               ->findAll();
---
SELECT *
FROM `blogs`
WHERE `author_id` = '2'
ORDER BY `created_at` DESC

    public function rejectedBlogs()
    {
        $this->requireLogin();
        $this->checkRole('author');

        $model = new BlogModel();
        $authorId = session()->get('user_id');

        // Get rejected blogs (is_approved = -1) including admin_review field
        $data['blogs'] = $model->select('id, title, content, image, category, admin_review')
                               ->where('author_id', $authorId)
                               ->where('is_approved', -1)
                               ->orderBy('created_at', 'DESC')
                               ->findAll();
---
SELECT `id`, `title`, `content`, `image`, `category`, `admin_review`
FROM `blogs`
WHERE `author_id` = '1'
AND `is_approved` = -1
ORDER BY `created_at` DESC

    public function editRejected($id)
    {
        $this->requireLogin();
        $this->checkRole('author');

        $model = new BlogModel();
        $blog = $model->where('id', $id)
                      ->where('author_id', session()->get('user_id'))
                      ->where('is_approved', -1)
                      ->first();
---
SELECT *
FROM `blogs`
WHERE `id` = '36'
AND `author_id` = '1'
AND `is_approved` = -1
 LIMIT 1