app/Controllers/AdminController.php

SELECT *
FROM `blogs`
WHERE `is_approved` = 0
---
    public function pendingBlogs()
    {
        $this->requireLogin();
        $this->checkRole('admin');

        $blogModel = new BlogModel();
        $data['blogs'] = $blogModel->where('is_approved', 0)->findAll();

SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '37'
---
    public function viewPending($id)
{
    $blogModel = new \App\Models\BlogModel();
    $blog = $blogModel->find($id);