app/Controllers/AuthController.php

    public function doLogin()
    {
        $username = $this->request->getPost('username');
        $password = md5($this->request->getPost('password'));

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)
                          ->where('password', $password)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = '0192023a7bbd73250516f069df18b500'
 LIMIT 1