app/Controllers/Blogcontroller.php

    public function store()
    {
        $this->requireLogin();
        $this->checkRole('author');

        $model = new BlogModel();

        $imageName = null;
        $image = $this->request->getFile('image');

        if ($image && $image->isValid() && !$image->hasMoved()) {
            $imageName = $image->getRandomName();
            $image->move('uploads', $imageName);
        }

        $data = [
            'title'       => $this->request->getPost('title'),
            'content'     => $this->request->getPost('content'),
            'author_id'   => session()->get('user_id'),
            'image'       => $imageName,
            'category'    => $this->request->getPost('category'),
            'is_approved' => 0
        ];

        $model->insert($data);
---
INSERT INTO `blogs` (`title`, `content`, `author_id`, `image`, `category`, `is_approved`, `created_at`, `updated_at`) VALUES ('New Blog', 'fhvbsdjvancln jncjnsc', '1', '1753698821_992452cde236e76375b0.png', 'Education', 0, '2025-07-28 10:33:41', '2025-07-28 10:33:41')

    public function index()
    {
        $model = new BlogModel();
        $keyword = $this->request->getGet('search');

        if ($keyword) {
            $data['blogs'] = $model
                ->like('title', $keyword)
                ->orLike('content', $keyword)
                ->where('is_approved', 1)
                ->orderBy('created_at', 'DESC')
                ->findAll(10, 0);
        } else {
            $data['blogs'] = $model
                ->where('is_approved', 1)
                ->orderBy('created_at', 'DESC')
                ->findAll(10, 0);
---
SELECT *
FROM `blogs`
WHERE `is_approved` = 1
ORDER BY `created_at` DESC