app/Controllers/HomeController.php

SELECT *
FROM `blogs`
WHERE `is_approved` = 1
ORDER BY `created_at` DESC
 LIMIT 10
SELECT *
FROM `categories`
---
    public function index()
    {
        // ✅ Force login before accessing homepage
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        helper('text');

        $model = new BlogModel();
        $categoryModel = new CategoryModel(); // ✅ new

        $search = $this->request->getGet('search');
        $category = $this->request->getGet('category');

        $builder = $model->where('is_approved', 1);

        if ($search) {
            $builder->groupStart()
                    ->like('title', $search)
                    ->orLike('content', $search)
                    ->groupEnd();
        }

        if ($category) {
            $builder->where('category', $category);
        }

        $data['blogs'] = $builder->orderBy('created_at', 'DESC')
                                 ->limit(10)
                                 ->findAll();

        // ✅ get all categories from categories table
        $data['categories'] = $categoryModel->findAll();