app/Models/BlogModel.php

SELECT `category`
FROM `blogs`
WHERE `is_approved` = 1
AND `category` != ''
AND category IS NOT NULL
GROUP BY `category`
ORDER BY `category` ASC
---
    public function getCategories()
    {
        return $this->select('category')
                    ->distinct()
                    ->where('is_approved', 1)
                    ->where('category !=', '') // avoid empty strings
                    ->where('category IS NOT NULL', null, false) // avoid NULL
                    ->orderBy('category', 'ASC')
                    ->findAll();