app/Models/CategoryModel.php

    public function getAllCategories()
    {
        return $this->orderBy('category_name', 'ASC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `category_name` ASC